case3/TemplateCase/0/C
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
2500
(
(-0.49 -0.488439 0.005)
(-0.47 -0.488439 0.005)
(-0.45 -0.488439 0.005)
(-0.43 -0.488439 0.005)
(-0.41 -0.488439 0.005)
(-0.39 -0.488439 0.005)
(-0.37 -0.488439 0.005)
(-0.35 -0.488439 0.005)
...
)
;

boundaryField
{
    left
    {
        type            calculated;
        value           nonuniform List<vector> 
50
(
(-0.5 -0.488439 0.005)
(-0.5 -0.465317 0.005)
(-0.5 -0.442195 0.005)
(-0.5 -0.419072 0.005)
(-0.5 -0.39595 0.005)
(-0.5 -0.372828 0.005)
(-0.5 -0.349706 0.005)
(-0.5 -0.326584 0.005)
...
)
;
    }
    right
    {
        type            calculated;
        value           nonuniform List<vector> 
50
(
(0.5 -0.488439 0.005)
(0.5 -0.465317 0.005)
(0.5 -0.442195 0.005)
(0.5 -0.419072 0.005)
(0.5 -0.39595 0.005)
(0.5 -0.372828 0.005)
(0.5 -0.349706 0.005)
(0.5 -0.326584 0.005)
...
)
;
    }
    up
    {
        type            calculated;
        value           nonuniform List<vector> 
50
(
(-0.49 0.5 0.005)
(-0.47 0.5 0.005)
(-0.45 0.5 0.005)
(-0.43 0.5 0.005)
(-0.41 0.5 0.005)
(-0.39 0.5 0.005)
(-0.37 0.5 0.005)
(-0.35 0.5 0.005)
...
)
;
    }
    down
    {
        type            calculated;
        value           nonuniform List<vector> 
50
(
(-0.49 -0.5 0.005)
(-0.47 -0.5 0.005)
(-0.45 -0.5 0.005)
(-0.43 -0.5 0.005)
(-0.41 -0.5 0.005)
(-0.39 -0.5 0.005)
(-0.37 -0.5 0.005)
(-0.35 -0.5 0.005)
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
