case3/TemplateCase/0/Cy
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Cy;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
2500
(
-0.488439
-0.488439
-0.488439
-0.488439
-0.488439
-0.488439
-0.488439
-0.488439
...
)
;

boundaryField
{
    left
    {
        type            calculated;
        value           nonuniform List<scalar> 
50
(
-0.488439
-0.465317
-0.442195
-0.419072
-0.39595
-0.372828
-0.349706
-0.326584
...
)
;
    }
    right
    {
        type            calculated;
        value           nonuniform List<scalar> 
50
(
-0.488439
-0.465317
-0.442195
-0.419072
-0.39595
-0.372828
-0.349706
-0.326584
...
)
;
    }
    up
    {
        type            calculated;
        value           nonuniform List<scalar> 
50
(
0.5
0.5
0.5
0.5
0.5
0.5
0.5
0.5
...
)
;
    }
    down
    {
        type            calculated;
        value           nonuniform List<scalar> 
50
(
-0.5
-0.5
-0.5
-0.5
-0.5
-0.5
-0.5
-0.5
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
